test/fixtures/stripe_events/customer.subscription.created.json

{
  "api_version": "2024-06-20",
  "created": 1727793926,
  "data": {
    "object": {
      "application": null,
      "application_fee_percent": null,
      "automatic_tax": {
        "enabled": false,
        "liability": null
      },
      "billing_cycle_anchor": 1727793924,
      "billing_cycle_anchor_config": null,
      "billing_thresholds": null,
      "cancel_at": null,
      "cancel_at_period_end": false,
      "canceled_at": null,
      "cancellation_details": {
        "comment": null,
        "feedback": null,
        "reason": null
      },
      "collection_method": "charge_automatically",
      "created": 1727793924,
      "currency": "usd",
      "current_period_end": 1730472324,
      "current_period_start": 1727793924,
      "customer": "cus_Qx1NLJu5crzdoI",
      "days_until_due": null,
      "default_payment_method": null,
      "default_source": null,
      "default_tax_rates": [],
      "description": null,
      "discount": null,
      "discounts": [],
      "ended_at": null,
      "id": "sub_1Q57KKHWdrSF9AyBEDX8zHpr",
      "invoice_settings": {
        "account_tax_ids": null,
        "issuer": {
          "type": "self"
        }
      },
      "items": {
        "data": [
          {
            "billing_thresholds": null,
            "created": 1727793925,
            "discounts": [],
            "id": "si_Qx1NwasdszVfOs",
            "metadata": {},
            "object": "subscription_item",
            "plan": {
              "active": true,
              "aggregate_usage": null,
              "amount": 1500,
              "amount_decimal": "1500",
              "billing_scheme": "per_unit",
              "created": 1727793924,
              "currency": "usd",
              "id": "price_1Q57KKHWdrSF9AyBN3kVOWEH",
              "interval": "month",
              "interval_count": 1,
              "livemode": false,
              "metadata": {},
              "meter": null,
              "nickname": null,
              "object": "plan",
              "product": "prod_Qx1NSaJp6bsE1X",
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "price": {
              "active": true,
              "billing_scheme": "per_unit",
              "created": 1727793924,
              "currency": "usd",
              "custom_unit_amount": null,
              "id": "price_1Q57KKHWdrSF9AyBN3kVOWEH",
              "livemode": false,
              "lookup_key": null,
              "metadata": {},
              "nickname": null,
              "object": "price",
              "product": "prod_Qx1NSaJp6bsE1X",
              "recurring": {
                "aggregate_usage": null,
                "interval": "month",
                "interval_count": 1,
                "meter": null,
                "trial_period_days": null,
                "usage_type": "licensed"
              },
              "tax_behavior": "unspecified",
              "tiers_mode": null,
              "transform_quantity": null,
              "type": "recurring",
              "unit_amount": 1500,
              "unit_amount_decimal": "1500"
            },
            "quantity": 1,
            "subscription": "sub_1Q57KKHWdrSF9AyBEDX8zHpr",
            "tax_rates": []
          }
        ],
        "has_more": false,
        "object": "list",
        "total_count": 1,
        "url": "/v1/subscription_items?subscription=sub_1Q57KKHWdrSF9AyBEDX8zHpr"
      },
      "latest_invoice": "in_1Q57KKHWdrSF9AyBfPXDFSf9",
      "livemode": false,
      "metadata": {},
      "next_pending_invoice_item_invoice": null,
      "object": "subscription",
      "on_behalf_of": null,
      "pause_collection": null,
      "payment_settings": {
        "payment_method_options": null,
        "payment_method_types": null,
        "save_default_payment_method": "off"
      },
      "pending_invoice_item_interval": null,
      "pending_setup_intent": null,
      "pending_update": null,
      "plan": {
        "active": true,
        "aggregate_usage": null,
        "amount": 1500,
        "amount_decimal": "1500",
        "billing_scheme": "per_unit",
        "created": 1727793924,
        "currency": "usd",
        "id": "price_1Q57KKHWdrSF9AyBN3kVOWEH",
        "interval": "month",
        "interval_count": 1,
        "livemode": false,
        "metadata": {},
        "meter": null,
        "nickname": null,
        "object": "plan",
        "product": "prod_Qx1NSaJp6bsE1X",
        "tiers_mode": null,
        "transform_usage": null,
        "trial_period_days": null,
        "usage_type": "licensed"
      },
      "quantity": 1,
      "schedule": null,
      "start_date": 1727793924,
      "status": "active",
      "test_clock": null,
      "transfer_data": null,
      "trial_end": null,
      "trial_settings": {
        "end_behavior": {
          "missing_payment_method": "create_invoice"
        }
      },
      "trial_start": null
    }
  },
  "id": "evt_1Q57KNHWdrSF9AyB0c5ssc4F",
  "livemode": false,
  "object": "event",
  "pending_webhooks": 2,
  "request": {
    "id": "req_TTrZBfDUfdK3iI",
    "idempotency_key": "08ded244-9d71-4567-81dc-db594daf1f83"
  },
  "type": "customer.subscription.created"
}
